<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>PayloadContent</key>
	<array>
		<dict>
			<key>ExtensionData</key>
			<dict>
				<key>allowPasswordChange</key>
				<true/>
				<key>allowPlatformSSOAuthFallback</key>
				<true/>
				<key>performKerberosOnly</key>
				<true/>
				<key>pwReqComplexity</key>
				<true/>
				<key>syncLocalPassword</key>
				<false/>
				<key>usePlatformSSOTGT</key>
				<true/>
				<key>preferredKDCs</key>                         
                <array>
                <string>kkdcp://login.microsoftonline.com/pkz.ch/kerberos</string>
                </array>
			</dict>
			<key>ExtensionIdentifier</key>
			<string>com.apple.AppSSOKerberos.KerberosExtension</string>
			<key>Hosts</key>
			<array>
				<string></string>
				<string></string>
				<string></string>
				<string></string>
				<string>windows.net</string>
				<string>*.windows.net</string>
				<string>KERBEROS.MICROSOFTONLINE.COM</string>
				<string>MICROSOFTONLINE.COM</string>
				<string>*.MICROSOFTONLINE.COM</string>
			</array>
			<key>PayloadDisplayName</key>
			<string>Single Sign-On Extensions Payload</string>
			<key>PayloadIdentifier</key>
			<string>com.apple.extensiblesso.1DC82D32-9E3F-4116-A610-825B1CF6F5E7</string>
			<key>PayloadType</key>
			<string>com.apple.extensiblesso</string>
			<key>PayloadUUID</key>
			<string>1DC82D32-9E3F-4116-A610-825B1CF6F5E7</string>
			<key>PayloadVersion</key>
			<integer>1</integer>
			<key>Realm</key>
			<string>KERBEROS.MICROSOFTONLINE.COM</string>
			<key>TeamIdentifier</key>
			<string>apple</string>
			<key>Type</key>
			<string>Credential</string>
			<key>URLs</key>
            <array/>
		</dict>
	</array>
	<key>PayloadDisplayName</key>
	<string>KerberosSSOCloud</string>
	<key>PayloadEnabled</key>
    <true/>
	<key>PayloadIdentifier</key>
	<string>iMazing-Profile-Editor.10075FB0-F5B8-4C8C-A648-DAC345448D77</string>
	<key>PayloadOrganization</key>
    <string>vzug</string>
    <key>PayloadRemovalDisallowed</key>
    <true/>
    <key>PayloadScope</key>
    <string>System</string>
	<key>PayloadType</key>
	<string>Configuration</string>
	<key>PayloadUUID</key>
	<string>10075FB0-F5B8-4C8C-A648-DAC345448D77</string>
	<key>PayloadVersion</key>
	<integer>1</integer>
</dict>
</plist>
